In [175]:
import pandas as pd
import warnings         # warnings : 버전 충돌 및 특정 예외 처리를 위해 불러온 내장 모듈
warnings.filterwarnings("ignore", category=RuntimeWarning)

In [176]:
populations = pd.Series(index=['seoul', 'busan', 'mokpo'], data=[968, 340, 22])
#population 인덱스 및 데이터 출력
populations

seoul    968
busan    340
mokpo     22
dtype: int64

In [177]:
# Pandas Series의 기초정보
print('형태: ', populations.shape)
print('차원: ', populations.ndim)
print('총원소의 갯수: ', populations.size)

형태:  (3,)
차원:  1
총원소의 갯수:  3

In [178]:
# 인덱스와 데이터
print('인덱스: ', populations.index)
print('데이터: ', populations.values)

인덱스:  Index(['seoul', 'busan', 'mokpo'], dtype='object')
데이터:  [968 340  22]

In [179]:
# 인덱스를 통해 데이터 접근
print(populations['seoul'], "\n\n")
print(populations[['seoul', 'busan']], "\n\n")
print(populations.loc[['mokpo', 'busan']], "\n\n")
print(populations[[1,2]], "\n\n")
print(populations.iloc[[1,2]], "\n\n")

968


seoul    968
busan    340
dtype: int64


mokpo     22
busan    340
dtype: int64


busan    340
mokpo     22
dtype: int64


busan    340
mokpo     22
dtype: int64

# 1. csv 파일 read

In [180]:
df = pd.read_csv('friend_list.csv')

In [181]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [182]:
# 데이터가 많으면 head 함수 이용
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [183]:
df.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

txt 파일도 read_csv함수로 읽는다

In [184]:
df = pd.read_csv('friend_list_tab.txt')

In [185]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

tab으로 구분되어 있지 않아서 delimiter인자를 넣어 tab으로 구분하게 한다.

In [186]:
df = pd.read_csv('friend_list_tab.txt', delimiter='\t')

In [187]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

header가 없는 csv파일 읽는다

In [188]:
df = pd.read_csv('friend_list_no_head.csv')

In [189]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

header가 없어 첫번째 데이터가 컬럼이 된다. 이상황을 방지하기 위해 header파라미터를 넣는다

In [18]:
df = pd.read_csv('friend_list_no_head.csv', header = None)

In [19]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

column 이름을 넣는다

In [20]:
df.columns = ['name', 'age', 'job']

In [21]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

header=None과 df.column으로 header값을 넣는 2단계를 1단계로도 할수 있다.

In [22]:
df = pd.read_csv('friend_list_no_head.csv', header=None, names=['name', 'age', 'job'])

In [86]:
df

    name  age        job
0   John   18    student
1  Kelly   34  developer
2   Dana   30       None
3  David   54    teacher

# 2. 데이터 프레임 생성

In [29]:
friend_dict_list = [
    {'name':'John', 'age':18, 'job':'student'},
    {'name':'Kelly', 'age':34, 'job':'developer'},
    {'name':'Dana', 'age':30, 'job':'nurse'},
    {'name':'David', 'age':54, 'job':'teacher'}
]

In [30]:
df = pd.DataFrame(friend_dict_list)

In [31]:
df

    name  age        job
0   John   18    student
1  Kelly   34  developer
2   Dana   30      nurse
3  David   54    teacher

Dictionary는 키의 순서가 보장이 되지 않는다

In [32]:
df = df[['name', 'job', 'age']]

In [33]:
df

    name        job  age
0   John    student   18
1  Kelly  developer   34
2   Dana      nurse   30
3  David    teacher   54

In [8]:
from collections import OrderedDict

In [43]:
friend_ordered_dict = OrderedDict(
[
    ('name',['John', 'Kelly', 'Dana', 'David']),
    ('age',[18, 20, 34, 54]),
    ('job',['student', 'developer', 'nurse', 'teacher'])
]
)

In [44]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [45]:
df

    name  age        job
0   John   18    student
1  Kelly   20  developer
2   Dana   34      nurse
3  David   54    teacher

In [47]:
friend_list = [
    ['John', 20, 'student'],
    ['Kelly', 20, 'developer'],
    ['Dana', 34, 'nurse'],
    ['David', 54, 'teacher']
]

In [48]:
column_name=['name' , 'age', 'job']

In [49]:
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [50]:
df

    name  age        job
0   John   20    student
1  Kelly   20  developer
2   Dana   34      nurse
3  David   54    teacher

In [51]:
friend_list=[
    ['name', ['John', 'Kelly', 'Dana', 'David']],
    ['age', [18, 20, 34, 54]],
    ['job', ['student', 'developer', 'nurse', 'teacher']]
]

In [72]:
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [73]:
df

    name  age        job
0   John   18    student
1  Kelly   20  developer
2   Dana   34      nurse
3  David   54    teacher

# 3. 데이터 프레임을 파일로 저장

참고자료. https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html

In [80]:
friend_dict_list = [
    {'name':'John', 'age':18, 'job':'student'},
    {'name':'Kelly', 'age':34, 'job':'developer'},
    {'name':'Dana', 'age':30, 'job':None},
    {'name':'David', 'age':54, 'job':'teacher'}
]

In [81]:
df = pd.DataFrame(friend_dict_list)

In [82]:
df.to_csv('friends_new.csv', index=True, header=True) #index와 header는 default값

In [83]:
df.to_csv('friend_noidx.csv', index=False, header=True) #열 첫번째 row num을 없애는 방법 index=False

In [84]:
df.to_csv('friend_noheader.csv', index=False, header=False) 
#index는 열첫번째 번호 의미 header는 행 첫번째 데이터 제목들 의미, 데이터 제목들 없애는 방법 header=Falase

In [85]:
df.to_csv('friend_na.csv', index=False, header=False, na_rep='-') #빈값, none 값은 -로 대체

# 4. 데이터프레임 필터

In [87]:
friend_list=[
    ['name', ['John', 'Kelly', 'Dana', 'David']],
    ['age', [18, 20, 34, 54]],
    ['job', ['student', 'developer', 'nurse', 'teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [88]:
df

    name  age        job
0   John   18    student
1  Kelly   20  developer
2   Dana   34      nurse
3  David   54    teacher

In [89]:
df[1:3] #리스트 안에 인텍스를 주면 1번부터 3-1까지 그러니깐 1, 2까지 df에 적용되지 않음 df=df[1:3] 적용됨

    name  age        job
1  Kelly   20  developer
2   Dana   34      nurse

In [90]:
df

    name  age        job
0   John   18    student
1  Kelly   20  developer
2   Dana   34      nurse
3  David   54    teacher

불연속적인 데이터를 원할때 즉, 0, 2 혹은 0, 3 loc이용

In [92]:
df.loc[[0, 2]]

   name  age      job
0  John   18  student
2  Dana   34    nurse

In [93]:
df = df.loc[[0,2]]

In [94]:
df

   name  age      job
0  John   18  student
2  Dana   34    nurse

### 행필터

In [101]:
friend_list=[
    ['name', ['John', 'Kelly', 'Dana', 'David']],
    ['age', [18, 20, 34, 54]],
    ['job', ['student', 'developer', 'nurse', 'teacher']],
    ['salary', [0, 10000, 5000, 8000]]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [102]:
df

    name  age        job  salary
0   John   18    student       0
1  Kelly   20  developer   10000
2   Dana   34      nurse    5000
3  David   54    teacher    8000

In [103]:
df[df.age>25] #select * from friend_list where age>25

    name  age      job  salary
2   Dana   34    nurse    5000
3  David   54  teacher    8000

In [104]:
df.query('age>25')

    name  age      job  salary
2   Dana   34    nurse    5000
3  David   54  teacher    8000

In [107]:
df[(df.age>25) & (df.salary>5000)] # select * from friend_list where age>25 and salary>5000

    name  age      job  salary
3  David   54  teacher    8000

### 컬럼필터

by column index

In [111]:
# 배열에서 Dataframe변환
friend_list=[
    ['John', '18', 'student', 0],
    ['Kelly', '34', 'developer', 10000],
    ['Dana', '30', 'nurse', 5000],
    ['David', '54', 'teacher', 8000]
]
df = pd.DataFrame.from_records(friend_list)

In [112]:
df

       0   1          2      3
0   John  18    student      0
1  Kelly  34  developer  10000
2   Dana  30      nurse   5000
3  David  54    teacher   8000

In [113]:
df.iloc[:, 0:2] #앞부분은 행 :만있음 다갖고 싶다 0:2 0번부터 1번

       0   1
0   John  18
1  Kelly  34
2   Dana  30
3  David  54

In [114]:
df.iloc[0:2, 0:2]

       0   1
0   John  18
1  Kelly  34

by column name

In [117]:
df = pd.read_csv('friend_list_no_head.csv', header=None, names=['name', 'age', 'job'])

In [118]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [119]:
df_filtered = df[['name', 'age']]

In [120]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [121]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [122]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [123]:
df.filter(like='a', axis=1) #column은 언제나 axis=1

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [124]:
df.filter(regex='b$', axis=1) #정규식을 이용하여 필터 할수 있다.

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

# row column을 삭제 하는 방법

In [126]:
friends=[
    {'age':15, 'job':'student'}, 
    {'age':25, 'job':'developer'}, 
    {'age':30, 'job':'teacher'}, 
]
df = pd.DataFrame(friends, 
                  index=['John', 'Jenny', 'Nate'],
                  columns=['age', 'job'])

In [127]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [128]:
df.drop(['John', 'Nate']) 
#삭제하고자 하는 컬럼의 이름을 넣는다 df=df.drop(['John', 'Nate'])
#혹은 inplace=True을 이용하여 삭제 가능 df.drop(['John' ,'Nate'], inplace=True)

       age        job
Jenny   25  developer

In [130]:
friends=[
    {'name':'John', 'age':15, 'job':'student'}, 
    {'name':'Ben', 'age':25, 'job':'developer'}, 
    {'name':'Jenny', 'age':30, 'job':'teacher'}, 
]
df = pd.DataFrame(friends, 
                  columns=['name', 'age', 'job'])

In [131]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

index를 이용한 삭제 방법

In [133]:
df=df.drop(df.index[[0,2]]) #0,2 여러개를 삭제하므로 배열에 넣고 삭제

In [134]:
df

  name  age        job
1  Ben   25  developer

In [135]:
friends=[
    {'name':'John', 'age':15, 'job':'student'}, 
    {'name':'Ben', 'age':25, 'job':'developer'}, 
    {'name':'Jenny', 'age':30, 'job':'teacher'}, 
]
df = pd.DataFrame(friends, 
                  columns=['name', 'age', 'job'])

column의 value에 따라서 삭제

In [136]:
df = df[df.age>20]

In [137]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [145]:
df = pd.DataFrame(friends, 
                  columns=['name', 'age', 'job'])

In [146]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

열을 삭제 하는 방법

In [147]:
df=df.drop('age', axis=1) # df.drop('age', axis=1, inplace=True)도 가능

In [148]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

# 데이터 프레임 행열 수정

In [14]:
friend_list=[
    ['name', ['John', 'Kelly', 'Dana', 'David']],
    ['age', [18, 20, 34, 54]],
    ['job', ['student', 'developer', 'nurse', 'teacher']],
    ['salary', [0, 10000, 5000, 8000]]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [17]:
df['address']='Seoul'

In [18]:
df['income']=0

In [19]:
df

    name  age        job  salary address  income
0   John   18    student       0   Seoul       0
1  Kelly   20  developer   10000   Seoul       0
2   Dana   34      nurse    5000   Seoul       0
3  David   54    teacher    8000   Seoul       0

In [20]:
!pip install numpy

Requirement already satisfied: numpy in /Users/yjjo/.pyenv/versions/3.9.1/lib/python3.9/site-packages (1.19.5)
WARNING: You are using pip version 20.2.3; however, version 20.3.3 is available.
You should consider upgrading via the '/Users/yjjo/.pyenv/versions/3.9.1/bin/python3.9 -m pip install --upgrade pip' command.

In [21]:
import numpy as np

In [22]:
df['income']=np.where(df['job'] != 'student', 'yes', 'no')

In [23]:
df

    name  age        job  salary address income
0   John   18    student       0   Seoul     no
1  Kelly   20  developer   10000   Seoul    yes
2   Dana   34      nurse    5000   Seoul    yes
3  David   54    teacher    8000   Seoul    yes

#

In [46]:
exam_result=[
    ['name', ['John', 'Kelly', 'Dana', 'David']],
    ['midterm', [80, 90, 83, 92]],
    ['final', [80, 92, 70, 84]]
]
df = pd.DataFrame.from_dict(OrderedDict(exam_result))

In [47]:
df

    name  midterm  final
0   John       80     80
1  Kelly       90     92
2   Dana       83     70
3  David       92     84

In [48]:
df['total'] = df['midterm'] + df['final']

In [49]:
df

    name  midterm  final  total
0   John       80     80    160
1  Kelly       90     92    182
2   Dana       83     70    153
3  David       92     84    176

In [50]:
df['avg'] = df['total']/2

In [51]:
df

    name  midterm  final  total   avg
0   John       80     80    160  80.0
1  Kelly       90     92    182  91.0
2   Dana       83     70    153  76.5
3  David       92     84    176  88.0

In [52]:
grades=[]
for row in df['avg']:
    if row>=90:
        grades.append('A')
    elif row>=80 and row <90:
        grades.append('B')
    else:
        grades.append('F')
df['grades']=grades

In [53]:
df

    name  midterm  final  total   avg grades
0   John       80     80    160  80.0      B
1  Kelly       90     92    182  91.0      A
2   Dana       83     70    153  76.5      F
3  David       92     84    176  88.0      B

In [54]:
def pass_or_fail(row):
    if row != 'F':
        return "Pass"
    else:
        return "Fail"

In [55]:
df['PF']=df.grades.apply(pass_or_fail) #row별로 인자가 들어가서 apply함수가 호출되고 grade가 적용, 연구 필요

In [56]:
df

    name  midterm  final  total   avg grades    PF
0   John       80     80    160  80.0      B  Pass
1  Kelly       90     92    182  91.0      A  Pass
2   Dana       83     70    153  76.5      F  Fail
3  David       92     84    176  88.0      B  Pass

In [57]:
date_list=[
    {
        'yyyy-mm-dd':'2016-05-28'
    },
    {
        'yyyy-mm-dd':'2018-04-23'
    }
]

In [58]:
df=pd.DataFrame(date_list)

In [59]:
df

   yyyy-mm-dd
0  2016-05-28
1  2018-04-23

In [62]:
def extract_year(row):
    return row.split('-')[0]

In [63]:
df['year']=df['yyyy-mm-dd'].apply(extract_year)

In [64]:
df

   yyyy-mm-dd  year
0  2016-05-28  2016
1  2018-04-23  2018

In [68]:
exam_result=[
    ['name', ['John', 'Kelly', 'Dana', 'David']],
    ['midterm', [80, 90, 83, 92]],
    ['final', [80, 92, 70, 84]]
]
df = pd.DataFrame.from_dict(OrderedDict(exam_result))

In [69]:
df

    name  midterm  final
0   John       80     80
1  Kelly       90     92
2   Dana       83     70
3  David       92     84

In [70]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns=['name', 'midterm', 'final'])

In [71]:
df2

  name  midterm  final
0  Ben       50     50

In [72]:
df.append(df2, ignore_index=True) #df에 이미 0번째 row가 있어서 df2의 index는 무시

    name  midterm  final
0   John       80     80
1  Kelly       90     92
2   Dana       83     70
3  David       92     84
4    Ben       50     50

# 데이터 그룹 만들기

In [73]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [74]:
groupby_major=df.groupby('major')

In [75]:
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [77]:
for name, group in groupby_major:
    print(name+ " :" +str(len(group)))
    print(group, "\n")

Computer Science :4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics :3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics :1
      name    major   sex
2  Abraham  Physics  male

Psychology :3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [79]:
df_major_cnt=pd.DataFrame({'count':groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [80]:
groupby_gender=df.groupby('sex')

In [82]:
for name, group in groupby_gender:
    print(name+ " :" +str(len(group)))
    print(group, "\n")

female :6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male :5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [84]:
df_gender_cnt = pd.DataFrame({'count':groupby_gender.size()}).reset_index()
df_gender_cnt

      sex  count
0  female      6
1    male      5

In [85]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [86]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [87]:
df.drop_duplicates()

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [88]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [89]:
df.duplicated() #정확하게 row모두가 일치해야 True

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

In [90]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [92]:
df.drop_duplicates(['name'], keep='first') #default가 first

       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
2   Abraham           Physics    male
3     Brian        Psychology    male
4     Janny         Economics  female
5      Yuna         Economics  female
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
8      Zara        Psychology  female
9     Wendy         Economics  female

# NaN(Null)값 관리

In [93]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [94]:
df.shape

(8, 3)

In [95]:
df.info() #age 2개가 none값

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [96]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [97]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [99]:
df.age = df.age.fillna(0) #age에서 none값을 0으로 change

In [101]:
#학생과 선생님의 나이가 0이면 말이 안되므로 합리적으로 바꾸자
#median값 이용

In [102]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [103]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace=True)
#df의 age중에 none값은 그들의 같은 직업을 가진 사람의 나이의 평균값으로 바꿔라

In [104]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

In [105]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [172]:
def extract_year(column):
    return column.split('-')[0]

In [107]:
df['year']=df['yyyy-mm-dd'].apply(extract_year)

In [108]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [109]:
def get_age(year, current_year):
    return int(current_year)-int(year)

In [110]:
df['age']=df['year'].apply(get_age, current_year=2021) #파라미터를 받아 apply함수 사용하는 방법

In [111]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   21
1  2002-09-24  2002   19
2  2005-12-20  2005   16

In [112]:
# 파라미터를 여러개 받아 apply함수를 사용하는 방법
def get_introduce(age, prefix, suffix):
    return prefix+str(age)+suffix

In [113]:
df['introduce']=df['age'].apply(get_introduce, prefix="I am ", suffix=" years old")

In [114]:
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   21  I am 21 years old
1  2002-09-24  2002   19  I am 19 years old
2  2005-12-20  2005   16  I am 16 years old

In [120]:
# 여러 컬럼에 적용하는 방법
def get_introduce_year(row):
    return "I was born in "+str(row.year)+" my age is "+str(row.age)

In [121]:
df.introduce = df.apply(get_introduce_year, axis=1) #df['introduce'] == df.introduce

In [122]:
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   21  I was born in 2000 my age is 21
1  2002-09-24  2002   19  I was born in 2002 my age is 19
2  2005-12-20  2005   16  I was born in 2005 my age is 16

In [126]:
date_list = [{'date': '2000-06-27'},
         {'date': '2002-09-24'},
         {'date': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [127]:
def extract_year(date): # 방법1
    return date.split('-')[0]

In [129]:
df['year'] = df['date'].map(extract_year) #방법2

In [130]:
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [135]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [136]:
df.job = df.job.map({'student':1, 'developer':2, 'teacher':3}) 
#값을 변경하는 방법 1 apply, 2 map함수로 dictionary를 직접 전달

In [137]:
df

   age  job
0   20    1
1   30    2
2   30    3

In [139]:
x_y = [{'x': 5.5, 'y': -5.6, 'z':-1.1},
         {'x': -5.2, 'y': 5.5, 'z':-2.2},
         {'x': -1.6, 'y': -4.5, 'z':-3.3}]
df = pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [140]:
# 모든 컬럼에 적용시킬때 applymap, 하나의 컬럼일때는 map
df = df.applymap(np.around)

In [141]:
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

# Unique

In [142]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

In [143]:
#unique한 값만 뽑기
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [144]:
df.job.unique()

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [145]:
df.job.value_counts()

teacher              8
student              5
banker               2
lawyer               2
basketball player    1
developer            1
dentist              1
Name: job, dtype: int64

# Dataframe 합치기

In [171]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

l3 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'John', 'job': "developer"}]

l4 = [{'age':25, 'country':'USA'}, 
      {'age':30, 'country':'UK'},
      {'age':45, 'country':'Korea'}]                  
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [148]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [149]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [152]:
result = pd.concat([df1, df2], ignore_index=True)

In [153]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [156]:
result = df1.append(df2, ignore_index=True)

In [157]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [158]:
# 열로 합치기 l3,l4

In [159]:
df1 = pd.DataFrame(l3, columns=['name', 'job'])
df2 = pd.DataFrame(l4, columns=['age', 'country'])

In [160]:
df1

   name        job
0  John    teacher
1  Nate    student
2  John  developer

In [161]:
df2

   age country
0   25     USA
1   30      UK
2   45   Korea

In [162]:
#같은 인덱스 끼리 합치기

In [165]:
result = pd.concat([df1, df2], axis=1, ignore_index=True)

In [166]:
result

      0          1   2      3
0  John    teacher  25    USA
1  Nate    student  30     UK
2  John  developer  45  Korea

In [167]:
#list 합치기

In [168]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [169]:
comparison = pd.DataFrame({'label':label, 'prediction':prediction})

In [170]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4